## 나이 구간 나누기
**basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오
(이상치는 음수(0포함), 소수점 값)**
- data: basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [1]:
import pandas as pd

df = pd.read_csv('../../dataset/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

## User Code

## Solution

In [2]:
import numpy as np
print(df.shape)
df = df[(df['age']>0) & (df['age']==round(df['age'], 0))]
print(df.shape)

(100, 8)
(90, 8)

In [3]:
df = df.sort_values('age', ascending=False).reset_index(drop=True)
df.head()

     id    age city    f1  f2   f3    f4         f5
0  id37  100.0   부산   NaN   0  NaN  ESTP  33.308999
1  id97  100.0   경기   NaN   0  NaN  INFP  67.886373
2  id52   97.0   대구  82.0   1  NaN  ISFJ  90.496999
3  id45   97.0   대구  88.0   0  NaN  ENFJ  13.049921
4  id92   97.0   경기  78.0   1  NaN  INFP  97.381034

In [4]:
df1 = df[:30]
df2 = df[30:60]
df3 = df[60:]
df2.shape, df2.shape, df3.shape

((30, 8), (30, 8), (30, 8))

In [5]:
df1['age'].median() + df2['age'].median() + df3['age'].median()

165.0

---

## Solution

In [6]:
df = pd.read_csv('../dataset/basic1.csv')
df = df[(df['age']>0) & (df['age']==round(df['age'], 0))]

In [7]:
pd.qcut(df['age'], q=3)

0      (0.999, 38.667]
1      (0.999, 38.667]
2      (0.999, 38.667]
3      (73.333, 100.0]
4      (0.999, 38.667]
            ...
95     (73.333, 100.0]
96     (73.333, 100.0]
97    (38.667, 73.333]
98     (0.999, 38.667]
99    (38.667, 73.333]
Name: age, Length: 90, dtype: category
Categories (3, interval[float64, right]): [(0.999, 38.667] < (38.667, 73.333] < (73.333, 100.0]]

In [8]:
# 구간분할
df['range'] = pd.qcut(df['age'], q=3, labels=['group1', 'group2', 'group3'])
df.head()

     id   age city    f1  f2   f3    f4         f5   range
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  group1
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  group1
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986  group1
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078  group3
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869  group1

In [9]:
# 수량비교
df['range'].value_counts()

group1    30
group2    30
group3    30
Name: range, dtype: int64

In [10]:
g1_med = df[df['range']=='group1']['age'].median()
g2_med = df[df['range']=='group2']['age'].median()
g3_med = df[df['range']=='group3']['age'].median()

In [11]:
g1_med + g2_med + g3_med

165.0